import { Helmet } from "react-helmet-async";
import { useEffect } from "react";

const termsContent = [
  "1. مرحبا بك في خدمة! باستخدامك لخدماتنا، فإنك توافق على الشروط والأحكام التالية. يرجى قراءتها بعناية قبل استخدام الخدمة.",
  "2. يجب على جميع الحرفيين تقديم خدمات عالية الجودة وضمان رضا العملاء. أي سوء استخدام للخدمة أو عدم الالتزام بالشروط قد يؤدي إلى اتخاذ إجراءات قانونية.",
  "3. يمكن للمستخدمين إلغاء الخدمات قبل 24 ساعة من الموعد المحدد. أي إلغاء بعد هذه المدة قد يتطلب رسومًا تقدر بنسبة 50% من قيمة الخدمة المتفق عليها.",
  "4. نحن نأخذ خصوصيتك على محمل الجد. جميع المعلومات الشخصية التي تجمعها خدمتنا ستبقى سرية.",
  "5. يحتفظ الموقع بالحق في تعديل هذه الشروط والأحكام في أي وقت. سيتم إبلاغ المستخدمين بالتعديلات.",
  "6. يُمنع استخدام الخدمة لأغراض غير قانونية. أي انتهاك لهذه القواعد سيؤدي إلى إنهاء الحساب.",
  "7. نحن لسنا مسؤولين عن أي أضرار أو خسائر ناجمة عن استخدام الخدمة.",
  "8. يجب على المستخدمين تقديم معلومات صحيحة وكاملة عند التسجيل واستخدام الخدمة.",
  "9. يمكن للمستخدمين تقديم الشكاوى أو التعليقات عبر قنوات الدعم الخاصة بنا.",
  "10. باستخدامك لهذه الخدمة، فإنك توافق على الالتزام بجميع القوانين المعمول بها.",
  "11. يحتفظ الموقع بحق إلغاء أو تعليق أي حساب ينتهك الشروط.",
  "12. سيتم التعامل مع جميع الشكاوى بجدية وسرية.",
  "13. يجب على الحرفيين الالتزام بالمواعيد المتفق عليها مع العملاء.",
  "14. يمكن للمستخدمين الوصول إلى معلومات حساباتهم في أي وقت.",
  "15. يحق للمستخدمين تغيير معلوماتهم الشخصية في أي وقت.",
  "16. قد يتم استخدام بيانات المستخدم لأغراض تحليلية فقط.",
  "17. يتم توفير الخدمة كما هي، دون ضمانات لأي نتائج.",
  "18. يجب على المستخدمين احترام جميع حقوق الملكية الفكرية المتعلقة بالخدمة.",
  "19. لا يُسمح للمستخدمين بإنشاء حسابات متعددة.",
  "20. يُعتبر استخدامك للخدمة قبولاً لجميع الشروط المذكورة.",
];

export default function Terms() {
  useEffect(() => {
    window.scrollTo({
      top: 0,
      behavior: "smooth",
    });
  }, []);

  return (
    <>
      <Helmet>
        <title>خدمة | الشروط والأحكام</title>
      </Helmet>
      <div
        dir="rtl"
        className="my-12 flex min-h-screen flex-col items-center justify-center px-8"
      >
        <h1 className="mb-12 rounded-3xl border-2 border-primary px-4 py-4 text-center text-3xl font-extrabold text-gray-600 md:text-3xl">
          الشروط والأحكام
        </h1>

        <div className="space-y-6">
          {termsContent.map((term, index) => (
            <div
              key={index}
              className="rounded-lg bg-gray-50 p-4 shadow-sm transition-shadow duration-300 hover:shadow-md"
            >
              <p className="text-right text-lg font-medium text-gray-700">
                {term}
              </p>
            </div>
          ))}
        </div>

        <div className="pointer-events-none absolute"></div>
      </div>
    </>
  );
}
